systests/ws-specs/src/test/java/org/apache/cxf/systest/ws/security/test-data/UsernameTokenRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wss:Security xmlns:wss="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <wss:UsernameToken>
            <wss:Username>alice</wss:Username>
            <wss:Password 
                Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"
            >password</wss:Password>
         </wss:UsernameToken>
    </wss:Security>
  </soap:Header>
  <soap:Body>
    <sayHi xmlns="http://apache.org/hello_world_soap_http/types"/>
  </soap:Body>
</soap:Envelope>
